# Brewfile — managed by chezmoi, deployed to ~/Brewfile
# Install everything: brew bundle
# Install one section at a time by commenting others out.
#
# Note: per the dotfiles philosophy this is NOT run automatically.
# Run it manually after reviewing on a new machine.

# ── Taps ──────────────────────────────────────────────────────────────────────
tap "jesseduffield/lazydocker"
tap "speakeasy-api/tap"
tap "worktrunk/tap"

# ═══════════════════════════════════════════════════════════════════════════════
# BOTH MACHINES
# ═══════════════════════════════════════════════════════════════════════════════

# ── Shell & terminal ──────────────────────────────────────────────────────────
brew "bat"           # better cat
brew "chezmoi"       # dotfiles manager
brew "fd"            # better find
brew "gh"            # GitHub CLI
brew "git"
brew "git-delta"     # better git diffs (delta pager)
brew "jq"            # JSON processor
brew "lazygit"
brew "jesseduffield/lazydocker/lazydocker"
brew "mackup"        # Mac app config sync (iCloud)
brew "node"          # latest Node.js
brew "sd"            # better sed
brew "tmux"
brew "tree"
brew "uv"            # fast Python package manager
brew "worktrunk"     # git worktree manager (wt)
brew "z"             # directory jumper (for oh-my-zsh z plugin)

# ── Editors & code tools ──────────────────────────────────────────────────────
brew "neovim"

# ── Dev utilities ─────────────────────────────────────────────────────────────
brew "act"           # run GitHub Actions locally
brew "actionlint"    # GitHub Actions linter
brew "cloc"          # count lines of code
brew "scc"           # fast code counter
brew "httpie"        # HTTP client
brew "k6"            # load testing
brew "mkcert"        # local HTTPS certs
brew "nghttp2"
brew "pnpm"
brew "poetry"        # Python dependency management
brew "pipx"          # isolated Python CLI tools

# ── Infrastructure & cloud ────────────────────────────────────────────────────
brew "awscli"
brew "speakeasy-api/tap/speakeasy"

# ── Networking & security ─────────────────────────────────────────────────────
brew "dnsmasq"
brew "mtr"
brew "nmap"
brew "siege"         # HTTP load testing
brew "testssl"
brew "wget"

# ── Database ─────────────────────────────────────────────────────────────────
brew "pgcli"         # Postgres CLI with autocomplete
brew "pgformatter"
brew "redis"

# ── Other utilities ───────────────────────────────────────────────────────────
brew "rsync"

# ── Mac apps (casks) ──────────────────────────────────────────────────────────
cask "ghostty"       # terminal
cask "orbstack"      # Docker / Linux VMs
cask "finicky"       # browser router
cask "graphiql"      # GraphQL client
cask "db-browser-for-sqlite"
cask "ngrok"
cask "codex"         # OpenAI Codex CLI

# ═══════════════════════════════════════════════════════════════════════════════
# PERSONAL ONLY
# ═══════════════════════════════════════════════════════════════════════════════
{{ if eq .machineType "personal" -}}

# ── Xcode & iOS tooling ───────────────────────────────────────────────────────
brew "xcodegen"      # Xcode project generator

# ── Document & media processing ───────────────────────────────────────────────
brew "ocrmypdf"
brew "pandoc"
brew "poppler"       # PDF utils

# ── Static site generation ────────────────────────────────────────────────────
brew "hugo"          # static site generator

{{ end }}
# ═══════════════════════════════════════════════════════════════════════════════
# WORK ONLY
# ═══════════════════════════════════════════════════════════════════════════════
{{ if eq .machineType "work" -}}

# ── Taps ──────────────────────────────────────────────────────────────────────
tap "heroku/brew"

# ── Infrastructure & cloud ────────────────────────────────────────────────────
brew "heroku/brew/heroku"
brew "trufflehog"    # secret scanning

{{ end }}
